/*-------------------------------------------
功能：TMR2演示
版本：V1.0
日期：2021.01.04 

*本程序由 中微半导体 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn

-------------------------------------------*/

/*-------------------------------------------
备注：	  定时时间计算方法
          时钟输入为系统指令时钟（即为Fosc/4）
          定时时间T = {1/[(Fosc/4)*预分频比*后分频比]}*(PR2+1)
          本程序计算示例：
          T = {1/[(8/4)*0.25*1]}*250
		    = 125 us
-------------------------------------------*/ 

#include <sc.h>

void main(void)
{
	asm("nop");
	asm("clrwdt");
	OSCCON = 0X70;				//8M
	
	TRISA = 0;
	TRISB = 0;					//PORTB口作输出口
		
	PR2 = 249;					//设定Timer初始值，定时周期是250*4/8M=125uS
	TMR2IF = 0;
	TMR2IE = 1;					//使能Timer2溢出中断
	
	T2CON = 0B00000100;			//开启Timer2,设置TMR2的分频比为1:1
	
	INTCON = 0XC0;				//开启总中断
	while(1)
	{
		asm("clrwdt");
	}
}
/***********************************************
函数名称：Timer2_Isr
函数功能：中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt Timer1_Isr(void)
{
	if(TMR2IF)
	{
		TMR2IF = 0;
		
		PORTB ^= 0XFF;
	}
}
