/*-------------------------------------------
程序名称：休眠模式及唤醒程序演示
版本：V1.0
日期：2020.06.20 

备注：
1、WDT已在CONFIG中禁止，休眠模式下利用PORTA电平变化唤醒
2、休眠时，如果作输入口且外部输入电平不为0.9*VDD以上或0.1VDD以下，会有一定的电流产生，且越接近0.5*VDD电流越大。

*本程序由 中微半导体 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001030138	莫工
-------------------------------------------*/


#include <cms.h>


void Init_System();
void Sleep_Mode();

void main()
{
	Init_System();
	while(1)
	{
		asm("clrwdt");
		
		Sleep_Mode();
	}
}


/***********************************************
函数名称：Sleep_Mode
函数功能：进入休眠模式
入口参数：无
出口参数：无
备注：
************************************************/
void Sleep_Mode()
{
	INTCON = 0;		
	
	OPTION_REG = 0;
		 
	TRISA = 0B00000001; 		//关闭所有输出
	PORTA = 0B00000000;
	WPUA  = 0B00000001;
	
	TRISB = 0B00000000;	
	PORTB = 0B00000000;
	WPUB  = 0B00000000;	
   			
	

	IOCA = 0B00000001;			//允许RA0的IO口电平变化中断
	RAIF = 0;					//清PORTA电平变化中断标志位	
	RAIE = 1;					//允许PORTA电平变化中断
	PEIE = 1;				    //允许外设中断
	GIE = 1;					//
	ADCON0 = 0;					//关闭所有模块,减少电流消耗
	EECON1 = 0;					
	WDTCON = 0;					//关闭看门狗
	
	PORTA;						//读PORTA值并锁存,必须添加			
	asm("clrwdt");
	asm("sleep");				//进入休眠模式,在C中写STOP有可能不编译
	
	asm("nop");					//必须加入该指令
	asm("nop");					//必须加入该指令	
	asm("clrwdt");				//休眠唤醒后必须清看门狗
	
	WDTCON = 0x01;				//重新开启看门狗
	Init_System();				//唤醒产生中断后返回此处
}

/***********************************************
函数名称：Init_System
函数功能：系统初始化
入口参数：无
出口参数：无
备注：
************************************************/
void Init_System()
{
	asm("nop");
	asm("clrwdt");
	INTCON = 0;					//系统初始化
	OSCCON = 0X71;				//配置振荡为8M
	OPTION_REG = 0;
	
    WPUA  = 0B00000001;			//初始化上拉
    WPUB  = 0B00000000;								
 
	TRISA = 0B00000001;			//初始化IO状态
	TRISB = 0B00000000;
 
	PORTA = 0B00000000;
	PORTB = 0B00000000;			//初始化输出
}

/***********************************************
函数名称：PA_Isr
函数功能：PA电平变化中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt PA_Isr()
{
	if(RAIF)
	{
		PORTA;				//读取PORTA状态
		RAIF = 0;			//清中断标志
		
	}
}