#ifndef  _CMWATER_H_
#define  _CMWATER_H_
/*************************************************************************/
/*******************************************************
注：EEPROM的WAT_ADRL、WAT_ADRH、BASE_ADRL、BASE_ADRH地址存储初始触摸值，不能在其它地方对其进行写操作
	EEPROM的CHECKL_ADR、CHECKL_ADR为校验码，以便保证触摸值的正确性
	
测试时，将WAT_NUM：BASE_NUM = 1：255，观察wat_ram为当前检水触摸值，观察wat_base为当前基准触摸值
********************************************************/
extern volatile bit cmfstf;//此标志位清0，则重新读取EE存贮触摸基准判断值，若触摸基准判断值已经清零，则进入触摸检水测试
extern unsigned int	wat_ram;								//水位触摸检测值
extern unsigned int	wat_base;								//基准触摸检测值
extern unsigned int	watbase;								//基准触摸初始值
extern unsigned int	watram;									//水位触摸初始值
/*******************************************************
					函数声明				  
********************************************************/
unsigned char Water_test(void);//水位检测模块,建议放在主循环2.5ms-5ms调用，为了保证触摸的稳定性，上电时建议延时0.5S再去检测
/*
函数功能：水位检测模块
入口参数：
返回数据：1		有水
		  0		无水
		  0x55	EE没有存贮触摸基准值
		  0xaa	EE有存贮触摸基准值
		  0xfe	消抖处理中
		  0xff	出错
备注：	如果未写触摸基准值，则直接跳至写触摸值
*/

unsigned char	Wee_cm_clr(void);//测试模式时清触摸相关存贮值
/*
函数功能：测试模式清CM存贮数据
		清除失败则返回0
		成功则返回1
*/


/*******************************************************
					有无水存触摸值
0：有水存触摸值
1：无水存触摸值
********************************************************/
#define		W_NON			1//根据实际生产方便性调整

/*******************************************************
					触摸控制寄存器定义				  
********************************************************/
#define		Water_CH		12//水位触摸通道，例如KEY12，根据实际调整
/*******************************************************
					水位触摸键和基准的比例			  
********************************************************/
#define		WAT_NUM			1//需要实际测试确定补偿比例值
#define		BASE_NUM		1//需要实际测试确定补偿比例值
/*******************************************************
					存贮触摸值EEPROM地址
********************************************************/
#define		WAT_ADRL		0x05//一般默认
#define		WAT_ADRH		0x06//一般默认
#define		BASE_ADRL		0x07//一般默认
#define		BASE_ADRH		0x08//一般默认

#define		CHECKL_ADR		0x03//一般默认
#define		CHECKH_ADR		0x04//一般默认
/*******************************************************
					有无水差值
********************************************************/
#define		CM_D			40//需要根据实际方案调整，建议为触摸下降值的1/2+1


/*************************************************************************/
/*************************************************************************/
/*************************************************************************/
/*以下内容勿修改*/
/**************************************************************************/
/**************************************************************************/
/**************************************************************************/
//高触摸灵敏度使能
#define		H_SENS_EN	 1

const unsigned char wnon = W_NON;
const unsigned char CM_WSET = Water_CH | 0x20;
const unsigned char Wat_Num = WAT_NUM;
const unsigned char Base_Num = BASE_NUM;
const unsigned char Wat_Adrl = WAT_ADRL;
const unsigned char Wat_Adrh = WAT_ADRH;
const unsigned char Base_Adrl = BASE_ADRL;
const unsigned char Base_Adrh = BASE_ADRH;
const unsigned char Checkl_Adr = CHECKL_ADR;
const unsigned char Checkh_Adr = CHECKH_ADR;
const unsigned char Cm_D = CM_D;
const unsigned char H_Sens_EN = H_SENS_EN;
/*******************************************************
					位定义
********************************************************/
#define	Set(x,y)	((x) |= (1 << (y)))				//位置1
#define	Clr(x,y)	((x) &= ~ (1 << (y)))			//位清0

#define	b0(x,y)		(((x) & (1 << (y))) == 0)		//位0判断 if(b0(x,y)) 判断是否为0
#define	b1(x,y)		((x) & (1 << (y)))				//位1判断 if(b1(x,y)) 判断是否为1
/*******************************************************
					宏定义
********************************************************/
#define uchar	unsigned char
#define uint	unsigned int
#define ulong	unsigned long 
/*******************************************************/
#endif



