/*-------------------------------------------

程序名称：PORTB电平变化中断演示
版本：V1.0
日期：2020.06.20 

*本程序由 中微半导体 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001030138	莫工
-------------------------------------------*/

#include <cms.h>


void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0x71;			//内部振荡器用作系统时钟
	OPTION_REG = 0;

//---------------------------------------	
	WPUB = 0B00000001;		//使能上拉，使RB0为高
	TRISB = 0B00000001;		//设置RB0的IO口为输入
	IOCB = 0B00000001;		//允许RB0的IO口电平变化中断
	INTCON = 0x88;			//允许所有未被屏蔽的中断、禁止外设中断，使能PORTB电平变化中断
	PORTB;					//读取PORTB并锁存
//---------------------------------------		

	while(1)			
	{
		asm("clrwdt");
	}
}


/***********************************************
函数名称：PB_Isr
函数功能：PB电平变化中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt PB_Isr()
{
	if(RBIF)
	{
		PORTB;				//读取PORTB状态
		RBIF = 0;			//清中断标志
		
	}
}