/*-------------------------------------------

程序名称：PWM模式程序
日期版本：2019/12/27 <V1.0>

备注：

*本程序由 中微半导体有限公司 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001085706	陈工
-------------------------------------------*/




#include <cms.h>


void Set_CCP_PWM();


void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0X70;				//8M内部时钟
	
	TRISA = 0;					//配置PWM引脚为输出脚
	
	Set_CCP_PWM();				//设置PWM周期100us，占空比PWM0-20%、PWM1-40%、PWM2-60%、PWM3-80%、PWM4-50%
	
	while(1)
	{
		asm("clrwdt");
	}
}

/***********************************************
函数名称：Set_CCP_PWM
函数功能：CCP PWM模式初始化
入口参数：无
出口参数：无
备注：	//PWM周期 = [PWMTH<1:0>:PWMTL + 1]*Tosc*(CLKDIV分频)
		//脉冲宽度 = (PWMDx[9:0]+1)*TOSC*(CLKDIV分频值)
		//占空比 = (PWMDx[9:0]+1)/(PWMT[9:0]+1)
************************************************/
void Set_CCP_PWM()
{
	PWMTL = 0x8f;
	PWMTH = 0x05;					//周期T = 400*(1/8)us*2 = 100us
	PWMT4L = 0x8f;
	
	//PWM0 占空比设置为20%
	PWMD0L = 0x4f;					//(79+1)/(399+1) = 20%
	//PWM1 占空比设置为40%
	PWMD1L = 0x9f;					//(159+1)/(399+1) = 40%
	PWMD01H = 0x00;
	//PWM2 占空比设置为60%
	PWMD2L = 0xef;					//(239+1)/(399+1) = 60%
	//PWM3 占空比设置为80%
	PWMD3L = 0x3f;					//(319+1)/(399+1) = 80%
	PWMD23H = 0x10;
	//PWM4 占空比设置为50%
	PWMD4L = 0xc7;					//(199+1)/(399+1) = 50%
	
	
	PWM01DT = 0;
	PWM23DT = 0;
	
	PWMCON2 = 0B00000000;			//正常输出
	PWMCON1 = 0B00000000;			//禁止死区
	PWMCON0 = 0B00111111;			//PWM分频Fosc/2，使能PWM0、PWM1、PWM2、PWM3、PWM4

}
