/*-------------------------------------------
功能：PWM演示
版本：V1.0
日期：2020.06.20 

*本程序由 中微半导体 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001030138	莫工
-------------------------------------------*/

#include <cms.h>

void Set_PWM();

void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0X71;				//内部振荡器用作系统时钟
	
	TRISA = 0;					//配置PWM引脚为输出脚
	
	Set_PWM();				//设置PWM周期50us，占空比PWM0-20%、PWM1-40%、PWM2-60%、PWM3-80%、PWM4-50%
	
	while(1)
	{
		asm("clrwdt");
	}
}


/***********************************************
函数名称：Set_PWM
函数功能：PWM输出模式配置
入口参数：无
出口参数：无
备注：	//PWM周期 = [PWMTH<1:0>:PWMTL + 1]*Tosc*(CLKDIV分频)
		//死区宽度 = (PWMxDT[5:0]+1)*TOSC*(CLKDIV分频值)
		//占空比 = (PWMDx[9:0]+1)/(PWMT[9:0]+1)
		//PWM组别选择: 工程选型-PWM_SEL
************************************************/
void Set_PWM()
{
	PWMTL = 0x8f;					//PWM0~3共周期，周期低位
	PWMT4L = 0x8f;					//PWM4独立周期，周期低位		
	PWMTH = 0B00001101;				//周期高两位及PWM4占空比高两位	

									//PWM0~3周期为：(0B110001111+1)*(1/16)*2 =50uS
									//PWM4周期为：(0B1110001111+1)*(1/16)*2 =114uS		
	

	PWMD01H = 0x00;					//高位改变后不能立即生效，需要给占空比的低位寄存器后才能加载
	//PWM1 占空比设置为20%
	PWMD0L = 0x4f;					//(79+1)/(399+1) = 20%
	//PWM1 占空比设置为40%
	PWMD1L = 0x9f;					//(159+1)/(399+1) = 40%

	PWMD23H = 0x10;
	//PWM2 占空比设置为60%
	PWMD2L = 0xef;					//(239+1)/(399+1) = 60%
	//PWM3 占空比设置为80%
	PWMD3L = 0x3f;					//(319+1)/(399+1) = 80%

	//PWM4 占空比设置为25%
	PWMD4L = 0xE3;					//(227+1)/(911+1) = 25%
	
	
	PWM01DT = 0x3F;					//死区时间，低6位有效位=(0B00111111+1)*(1/16)*1 =4uS
	PWM23DT = 0;
	
	PWMCON2 = 0B00000000;			//正常输出
	PWMCON1 = 0B00000000;			//禁止死区；可使能PWM0/1互补，PWM2/3互补
	PWMCON0 = 0B00111111;			//PWM分频Fosc/2，使能PWM0、PWM1、PWM2、PWM3、PWM4

}