/*-------------------------------------------

程序名称：INT外部中断程序
日期版本：2019/12/27 <V1.1>

备注：

*本程序由 中微半导体有限公司 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001085706	陈工
-------------------------------------------*/

#include <cms.h>


void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0x71;			//8MHZ,内部振荡器用作系统时钟
	OPTION_REG = 0;

//---------------------------------------	
	INTEDG = 0;				//INT引脚下降沿触发
	INTCON = 0x90;			//允许所有未被屏蔽的中断、禁止外设中断，使能INT外部中断
//---------------------------------------		

	while(1)			
	{
		asm("clrwdt");
	}
}


/***********************************************
函数名称：INT_Isr
函数功能：INT中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt INT_Isr()
{
	if(INTF)
	{
		INTF = 0;			//清中断标志
		
	}
}