/*-------------------------------------------

程序名称：Timer1定时中断程序
日期版本：2019/12/27 <V1.1>

备注：	  定时时间计算方法
          定时时间T = {1/[(Fosc)*预分频比)]}*(65536-[TMR1H:TMR1L])
          本程序计算示例：
          T = {1/[(8)*1]}*(65536 - 64536)
		    = 125 us

*本程序由 中微半导体有限公司 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001085706	陈工
-------------------------------------------*/


#include <cms.h>


void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0x71;			//8MHZ,内部振荡器用作系统时钟
	
//---------------------------------------
	TMR1L = 0x18;			//赋初值
	TMR1H = 0xFC;
	TMR1IF = 0;				//清中断标志位
	TMR1IE = 1;				//允许Timer1中断	
	T1CON = 0x01;			//开启Timer1，使用内部时钟源Fosc，预分频比为1:1
//---------------------------------------	
	
	INTCON = 0xC0;			//允许所有未被屏蔽的中断、外设中断
	
	TRISB = 0x00;
	PORTB = 0x00;
	
	while(1)			
	{
		asm("clrwdt");
	}
}


/***********************************************
函数名称：Timer1_Isr
函数功能：中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt Timer1_Isr()
{
	if(TMR1IF)
	{
	//---------------------------------------
		TMR1L += 0x18;
		TMR1H += 0xFC;			//重新赋初值，在赋值前Timer1已有计数，故在该基础上加初值
	//---------------------------------------	
		
		TMR1IF = 0;				//清中断标志位
		PORTB ^= 0xff;
	}
}