/*-------------------------------------------

程序名称：Timer0定时中断程序
日期版本：2019/12/27 <V1.1>

备注：	  定时时间计算方法
          定时时间T = {1/[(Fosc/4)*预分频比]}*(256-TMR0)
          本程序计算示例：
          T = {1/[(8/4)*1/2]}*(256-131)
		    = 125 us

*本程序由 中微半导体有限公司 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001085706	陈工
-------------------------------------------*/

#include <cms.h>


void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0x71;			//8MHZ,内部振荡器用作系统时钟

//---------------------------------------	
	OPTION_REG = 0xD0;		//Timer0使用内部时钟Focs/4，预分频比为1:2
	TMR0 = 131;				//赋予初始值
	INTCON = 0xA0;			//允许所有未被屏蔽的中断、禁止外设中断，使能Timer0
//---------------------------------------		
	
	TRISB = 0x00;
	PORTB = 0x00;

	while(1)			
	{
		asm("clrwdt");
	}
}


/***********************************************
函数名称：Timer0_Isr
函数功能：中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt Timer0_Isr()
{
	if(T0IF)
	{
	//---------------------------------------
		TMR0 += 131;		//重新赋初值，在赋值前Timer0已有计数，故在该基础上加初值
	//---------------------------------------
			
		T0IF = 0;			//清中断标志位
		
		PORTB ^= 0xff;
	}
}