/*-------------------------------------------

程序名称：Timer2定时中断程序
日期版本：2019/12/27 <V1.0>

备注：	  定时时间计算方法
          时钟输入为系统指令时钟（即为Fosc/4）
          定时时间T = {1/[(Fosc/4)*预分频比*后分频比]}*PR2
          本程序计算示例：
          T = {1/[(8/4)*1*1]}*250
		    = 125 us

*本程序由 中微半导体有限公司 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001085706	陈工
-------------------------------------------*/


#include <cms.h>


void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0x71;			//8MHZ,内部振荡器用作系统时钟
	
//---------------------------------------
//125us中断初始化
	PR2 = 250;				//赋初值	
	TMR2IF = 0;				//清中断标志位
	TMR2IE = 1;				//允许Timer2中断
	T2CON = 0x04;			//开启Timer2，预分频值为1，后分频比为1:1
//---------------------------------------
	
	INTCON = 0xC0;			//允许所有未被屏蔽的中断、外设中断
	
	TRISB = 0x00;
	PORTB = 0x00;
	
	while(1)			
	{
		asm("clrwdt");
	}
}


/***********************************************
函数名称：Timer2_Isr
函数功能：中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt Timer2_Isr()
{
	if(TMR2IF)
	{
		TMR2IF = 0;	//清中断标志位
		
		PORTB ^= 0xff;
	}
}