/*-------------------------------------------
功能：LVD模块演示
版本：V1.0
日期：2020.06.20 

*本程序由 中微半导体 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001030138	莫工
-------------------------------------------*/

#include <cms.h>

void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0x71;			//内部振荡器用作系统时钟
	OPTION_REG = 0;			//预分频寄存器设置	
		
	LVDCON = 0x07;			//LVD电压设定3.0V,使能LVD
	INTCON = 0xC0;			//允许所有未被屏蔽的中断、允许外设中断	
	PIE2 = 0x01;			//允许LVD中断
//---------------------------------------		

	while(1)			
	{
		asm("clrwdt");
	}
}

/***********************************************
函数名称：LVD_Isr
函数功能：LVD中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt LVD_Isr()
{
	if(LVDIF)//VDD < LVD设定电压值(3.0V)
	{
		LVDIF = 0;			//清中断标志		
	}
}