
/*-------------------------------------------
功能：TMR1演示
版本：V1.0
日期：2020.06.20 

*本程序由 中微半导体 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001030138	莫工
-------------------------------------------*/

/*-------------------------------------------
备注：	  定时时间计算方法
          定时时间T = {1/[(Fosc)*预分频比)]}*(65535-[TMR1H:TMR1L])
          本程序计算示例：
          T = {1/[(16)*1]}*(65536 - 63536)
		    = 125 us
-------------------------------------------*/

#include <cms.h>

void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0x71;			//16MHZ,内部振荡器用作系统时钟
//125us中断初始化	
//---------------------------------------
	TMR1L = 0x30;			//赋初值
	TMR1H = 0xF8;
	TMR1IF = 0;				//清中断标志位
	TMR1IE = 1;				//允许Timer1中断	
	T1CON = 0x01;			//开启Timer1，使用内部时钟源Fosc，预分频比为1:1
//---------------------------------------	
	
	INTCON = 0xC0;			//允许所有未被屏蔽的中断、外设中断
	
	TRISB = 0x00;
	PORTB = 0x00;
	
	while(1)			
	{
		asm("clrwdt");
	}
}

/***********************************************
函数名称：Timer1_Isr
函数功能：中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt Timer1_Isr()
{
	if(TMR1IF)
	{
	//---------------------------------------
		TMR1L += 0x30;
		TMR1H += 0xF8;			//重新赋初值，在赋值前Timer1已有计数，故在该基础上加初值
								//在进入中断等过程中其实Time是一直在计数的
	//---------------------------------------	
		
		TMR1IF = 0;				//清中断标志位
		PORTB ^= 0xff;
	}
}