/*-------------------------------------------
功能：TMR0演示
版本：V1.0
日期：2020.06.20 

*本程序由 中微半导体 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn
*技术支持QQ 3001082102  罗工
            3001030138	莫工
-------------------------------------------*/

#include <cms.h>

void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0x71;			//16MHZ,内部振荡器用作系统时钟，Fsoc/1，4T系统，每条指令0.25us
//250us中断初始化
//---------------------------------------	
	OPTION_REG = 0x01;		//Timer0预分频比为1:4，每个值0.25uS*4=1uS
	TMR0 = 6;				//赋予初始值
	INTCON = 0xA0;			//允许所有未被屏蔽的中断、禁止外设中断，使能Timer0中断
//---------------------------------------		
	
	TRISB = 0x00;
	PORTB = 0x00;

	while(1)			
	{
		asm("clrwdt");
	}
}

/***********************************************
函数名称：Timer0_Isr
函数功能：中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt Timer0_Isr()
{
	if(T0IF)
	{
	//---------------------------------------
		TMR0 += 8;		//在操作TIME的时候,TIME是不计数的，一般为两个周期，所以多给两个数
	//---------------------------------------
			
		T0IF = 0;			//清中断标志位
		
		PORTB ^= 0xff;
	}
}